emacs/guides/calc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>calc</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">calc</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org909b7c3">basic usage</a></li>
<li><a href="#org1d945b1">time functions</a></li>
<li><a href="#org0ba2574">decimal, binary and hexidecimal</a></li>
<li><a href="#org290910e">angular modes</a></li>
<li><a href="#org66d69e5">calculus</a></li>
<li><a href="#orgbc4f79d">functions</a></li>
<li><a href="#orgc064af5">units</a></li>
</ul>
</div>
</div>

<div id="outline-container-org909b7c3" class="outline-2">
<h2 id="org909b7c3">basic usage</h2>
<div class="outline-text-2" id="text-org909b7c3">
<pre class="example">
TAB        ; swap numbers on top of stack
RET or SPC ; copy previous number to top of stack
</pre>
</div>
</div>

<div id="outline-container-org1d945b1" class="outline-2">
<h2 id="org1d945b1">time functions</h2>
<div class="outline-text-2" id="text-org1d945b1">
<pre class="example">
t N	calc-now
t N F	calc-floor (date)
        calc-time (x time)
t U	calc-unix-time
t D	calc-date (julian)
t C	calc-convert-time-zones
t Z	calc-time-zone (relative to utc in seconds)
t P	calc-date-part (select part)
</pre>
</div>
</div>

<div id="outline-container-org0ba2574" class="outline-2">
<h2 id="org0ba2574">decimal, binary and hexidecimal</h2>
<div class="outline-text-2" id="text-org0ba2574">
<pre class="example">
d 0 (calc-decimal-radix)
d 2 (calc-binary-radix)
d 6 (calc-hex-radix)
</pre>
</div>
</div>

<div id="outline-container-org290910e" class="outline-2">
<h2 id="org290910e">angular modes</h2>
<div class="outline-text-2" id="text-org290910e">
<pre class="example">
m r (calc-radians-mode) 
m d (calc-degrees-mode) ; default
m h (calc-hms-mode)
</pre>
</div>
</div>

<div id="outline-container-org66d69e5" class="outline-2">
<h2 id="org66d69e5">calculus</h2>
<div class="outline-text-2" id="text-org66d69e5">
<pre class="example">
' ; algebraic
a d (calc-derivative)
a i (calc-integral)
</pre>
</div>
</div>

<div id="outline-container-orgbc4f79d" class="outline-2">
<h2 id="orgbc4f79d">functions</h2>
<div class="outline-text-2" id="text-orgbc4f79d">
<pre class="example">
d g (calc-group-digits)
</pre>
</div>
</div>

<div id="outline-container-orgc064af5" class="outline-2">
<h2 id="orgc064af5">units</h2>
<div class="outline-text-2" id="text-orgc064af5">
<pre class="example">
u c (calc-convert-units)
u v (calc-enter-units-table)

;; example
253033
  uc sec  hms
  =&gt; 2 day + 22 hr + 17 min + 13 s

;; user-defined units
(setq math-additional-units '((dollar nil "Dollar")
                              (euro "1.27 dollar" "Euro")))
;; This resets calc's cache
(setq math-units-table nil)

(setq math-additional-units '((bytes "byte" "Bytes")
                              (bits "bit" "Bits")
                              (bps "bit / s" "Bits per second")
                              (byte "8 * bit" "Byte")
                              (bit nil "Bit")))

(setq math-additional-units '((GiB "1024 * MiB" "Giga Byte")
                              (MiB "1024 * KiB" "Mega Byte")
                              (KiB "1024 * B" "Kilo Byte")
                              (B nil "Byte")
                              (Gib "1024 * Mib" "Giga Bit")
                              (Mib "1024 * Kib" "Mega Bit")
                              (Kib "1024 * b" "Kilo Bit")
                              (b "B / 8" "Bit")))


</pre>

<p>
<a href="../guides.html">back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
